/*
 Localizable.strings
 RMBT
 
 Copyright © 2016 - 2019 SPECURE GmbH. All rights reserved.
 */

/* network type descriptions */
"connectivity.cellular" = "Cellular";
"connectivity.not-connected" = "Not connected";
"connectivity.wifi" = "Wi-Fi";

/* Alert view button */
"general.alertview.cancel" = "Cancel";
"general.alertview.close" = "Close";
"general.alertview.dismiss" = "Dismiss";
"general.alertview.error" = "Error";
"general.alertview.confirmation" = "Confirmation";

"general.alertview.ok" = "OK";
"general.alertview.reload" = "Reload";
"general.alertview.success" = "Success";

/* Filter sections title */
"history.filter.device" = "Device";
"history.filter.networktype" = "Network Type";
"history.qos.detail.test" = "Test";
"history.qos.headline.details" = "DETAILS";
"history.qos.headline.tests" = "TESTS";
"history.result.headline.details" = "Details";
"history.result.headline.map" = "Map";
"history.result.headline.measurement" = "Measurement";
"history.result.headline.network" = "Network";
"history.result.headline.qos" = "Quality of Service Tests";
"history.result.map.accuracy" = "Accuracy";
"history.result.map.invalid-coordinates" = "Invalid coordinates";
"history.result.map.latitude" = "Latitude";
"history.result.map.longitude" = "Longitude";
"history.result.map.result" = "Map Result";
"history.result.map.show" = "Show map";
"history.result.more-details" = "More details";
"history.result.qos.details" = "DETAILS";
"history.result.qos.details.description" = "DESCRIPTION";
"history.result.qos.details.failed" = "FAILED";
"history.result.qos.details.succeeded" = "SUCCEEDED";
"history.result.qos.results" = "Results";
"history.result.qos.results-detail" = "Results detail";
"history.result.time" = "Time";

/* History Sync Code Alert */
"history.sync.code-text" = "Sync Code";
"history.sync.code.copy" = "Copy code";
"history.sync.code.enter" = "Enter code";
"history.sync.code.enter-text" = "Enter sync code:";
"history.sync.code.request" = "Request code";
"history.sync.merge" = "To merge history from two different devices, request the sync code on one device and enter it on another device";
"history.sync.success-message" = "History synchronisation was successful.";
"history.sync.sync" = "Sync";

/* History index buttons */
"history.uibar.filter" = "Filter"; /* Unused */
"history.uibar.sync" = "Sync";

/* Loop Mode */
"loopmode.change_server.title" = "CHANGE SERVER";
"loopmode.init.btn.test" = "Run Speed Measurement";
"loopmode.init.btn.loop-test" = "Loop Test";
"loopmode.init.btn.loop-switch" = "Loop Mode";
"loopmode.init.server" = "Measurement Server";
"loopmode.init.network-name" = "Network Name";
"loopmode.test.header.measurement" = "MEASUREMENT";
"loopmode.test.header.current" = "CURRENT";
"loopmode.test.header.median" = "MEDIAN";
"loopmode.test.progress.format" = "LOOP MODE (%d of %d)";
"loopmode.test.init.title" = "LOOP MODE";
"loopmode.test.results.title" = "LOOP MODE RESULTS";
"loopmode.test.time_to_next_test.title" = "TIME TO NEXT TEST";
"loopmode.test.movement.title" = "MOVEMENT";
"loopmode.init.btn.loop.on" = "Loop On";
"loopmode.init.btn.loop.off" = "Loop Off";
"loopmode.test.immediately" = "Immediately";

"loopmode.test.state.init" = "INIT";
"loopmode.test.state.ping" = "PING";
"loopmode.test.state.download" = "DOWNLOAD";
"loopmode.test.state.upload" = "UPLOAD";
"loopmode.test.state.qos" = "QoS";
"loopmode.test.state.packet-loss" = "PACKET LOSS";
"loopmode.test.state.jitter" = "JITTER";

"loopmode.abort.abort" = "Abort";
"loopmode.abort.continue" = "Continue";
"loopmode.abort.keep" = "Keep";
"loopmode.abort.title" = "Abort?";
"loopmode.abort.message" = "Do you want to abort the measurement?";

"loopmode_alert.activation_privacy" = "Activation & Privacy";
"loopmode_alert.activation_privacy.description" = "The loop mode allow the automatic repetion of the tests.";

"loopmode_alert.data_usage" = "Data Usage";
"loopmode_alert.data_usage.description" = "Please note that high amount of data is being transferred during the loop mode. With high-speed internet connection, running 10 tests in a loop mode an consume 1GB or more of your data allowance.";
"loopmode_alert.data_usage.description_2" = "It is recommended to run the loop test only with a true flat rate where the aditional traffic does not generate additional cost.";
"loopmode_alert.battery_power" = "Battery Power";
"loopmode_alert.battery_power.description" = "The loop mode consumes a lot of battery power. Between the loop tests, the loop mode keeps GPS and the display active, thus the battery is drained much faster than in standby mode. The tests also consume battery power.";
"loopmode_alert.battery_power.description_2" = "The loop mode should only be used if an extended power supply is available.";
"loopmode_alert.items.item_1" = "The first test will start immediately after the Start button is pressed.";
"loopmode_alert.items.item_2" = "Further tests will start either after the waiting time has elapsed (default 30 min) or the configured distance has been reached (default 250m).";
"loopmode_alert.items.item_3" = "Tests will be carried out until the preconfigured number of tests has been performed (default 10 tests).";
"loopmode_alert.items.item_4" = "These values can be changed under Settings.";
"loopmode_alert.items.item_5" = "The loop mode is automatically terminated after 2 days.";
"loopmode_alert.items.item_6" = "The loop mode can be stopped at any time.";

/* Google Maps Legal Notice */
"info.google-maps.legal-notice" = "Legal Notice";

/* Intro location question */
"intro.location.question.message" = "To get the location service, please enable it in settings!"; /* Unused */
"intro.location.question.title" = "Using Location"; /* Unused */

/* network type description unknown
 unknown wifi or operator name */
"intro.network.connection.name-unknown" = "Unknown";
"intro.network.connection.unavailable" = "No network connection available";

/* Intro popup hardware app */
"intro.popup.hardware.app-ram" = "App RAM";
"intro.popup.hardware.cpu" = "CPU";
"intro.popup.hardware.system-ram" = "System RAM";
"intro.popup.hardware.usage" = "Hardware Usage";

/* Intro popup ip connection */
"intro.popup.ip.connection-progress" = "Connection in Progress...";
"intro.popup.ip.connections" = "IP Connections";
"intro.popup.ip.no-ip-text" = "Address not available";
"intro.popup.ip.v4-external" = "IPv4 External";
"intro.popup.ip.v4-internal" = "IPv4 Internal";
"intro.popup.ip.v6-internal" = "IPv6";
"intro.popup.ip.private-address" = "Private Address";
"intro.popup.ip.public-address" = "Public Address";

/* Intro popup location */
"intro.popup.location" = "Location";
"intro.popup.location.accuracy" = "Accuracy";
"intro.popup.location.age" = "Age";
"intro.popup.location.altitude" = "Altitude";
"intro.popup.location.position" = "Position";
"intro.popup.location.source" = "Source"; /* Unused */

/* Intro popup traffic */
"intro.popup.traffic.background" = "Background Traffic";
"intro.popup.traffic.download" = "Download traffic";
"intro.popup.traffic.upload" = "Upload traffic";

/* Map callout */
"map.callout.measurement" = "Measurement";
"map.callout.network" = "Network";

/* Table section header title */
"map.options.filter.overlay" = "Overlay";
"map.options.filter.country" = "Country of operators";
"map.options.filter.operators" = "Operators";
"map.options.filter.period" = "Period";
"map.options.filter.technologies" = "Technologies";

"map.options.filter.countries" = "Countries";
"map.options.filter.all_countries" = "All Countries";

/* Map overlay description */
"map.options.overlay.auto" = "Auto";
"map.options.overlay.heatmap" = "Heatmap";
"map.options.overlay.municipality" = "Municipality";
"map.options.overlay.points" = "Points";
"map.options.overlay.regions" = "Regions";
"map.options.overlay.settlements" = "Settlements";
"map.options.overlay.shapes" = "Shapes";
"map.options.overlay.whitespots" = "White spots";

/* New Map */
"map.search" = "Search for address, city…";
"map.technology.all" = "All";
"map.operator.all.short" = "All";
"map.operator.all.long" = "All Mobile Network Operators";
"map.title.operators" = "Mobile Network Operators";
"map.title.history" = "History";
"map.disclaimer" = "The map shows measurements done through the Nettfart apps.
It is not a coverage map.";
"map.popup.county" = "County";
"map.popup.municipality" = "Municipality";
"map.popup.count" = "Total Measurements";
"map.popup.download" = "Average Down";
"map.popup.upload" = "Average Up";
"map.popup.ping" = "Average Latency";
"map.title.details" = "Measurements";

/* Alert view test intro message */
"test.intro-message" = "WARNING! Usage of this application can result in a large data volume transfer. In a 3G network, the data volume for a single test is 5 to 10 MB. In a 4G network, this volume can exceed 100 MB. The application provider shall not be deemed responsible for excessive consumption caused by data transfer when using this application. When testing the internet connection, the user should consider the resulting Internet traffic and accept the consequences of the data transfer.";

"test.aborted-message" = "Test was aborted because the app went into background. Tests can only be performed while the app is running in foreground.";

"test.connection.could-not-connect" = "The connection cannot be established. The probable cause is that your connection is very slow";
"test.connection.lost" = "The connection to the test server was lost. Test aborted.";

/* Test phases */
"test.phase.download" = "Download";
"test.phase.init" = "Init";
"test.phase.ping" = "Ping";
"test.phase.upload" = "Upload";

"test.qos.failed" = "Quality of Service Test failed.";
"test.repeat" = "Repeat Test";
"test.result.not-submitted" = "Test was completed, but the results couldn't be submitted to the test server.";
"test.results.title" = "Test Results";

"RMBT-TEST-START_QOS_BUTTON" = "Test QoS";

/* Unit suffex */
"test.speed.unit" = "Mbps";

"main-view-button-map" = "MAP";
"history.delete" = "Delete";
"test.abort.title" = "Abort?";
"test.abort.abort" = "Abort";
"test.abort.continue" = "Continue";
"test.abort.message" = "Do you want to abort the measurement?";
"test.startagain" = "Start again";

/* Menu Items */
"RMBT-NI-HISTORY" = "History";
"RMBT-NI-HOME" = "Home";
"RMBT-NI-MAPS" = "Maps";
"RMBT-NI-STATISTICS" = "Statistics";
"RMBT-NI-SURVEY" = "Survey";
"RMBT-NI-HELP" = "Help";
"RMBT-NI-HISTORY-DETAILS" = "Details";
"RMBT-NI-HISTORY-TESTRESULT" = "Test Result";
"RMBT-NI-INFO" = "Info";
"RMBT-NI-LOOP-MODE" = "Loop Mode";

/* TabBar Items */
"tabbar.title.test" = "Test";
"tabbar.title.results" = "Results";
"tabbar.title.map" = "Map";
"tabbar.title.settings" = "Settings";

/* Navigation Item Titles */
"RMBT-NI-RESULT" = "Result";
"RMBT-NI-FILTER" = "Filter";
"RMBT-NI-SETTINGS" = "Settings";
"RMBT-NI-PUBLISHPERSONALDATA" = "Submit personal data"; /* Unused */

/* Info Items */
"RMBT-INFO-WEBSITE" = "Web site";
"RMBT-INFO-EMAIL" = "E-mail";
"RMBT-INFO-TERMS-AND-CONDITIONS" = "Terms of Use";
"RMBT-INFO-ONLY-PRIVACYPOLICY" = "Privacy Policy";
"RMBT-INFO-PRIVACYPOLICY" = "Privacy Policy";
"RMBT-INFO-PUBLISH-PERSONAL-DATA" = "Publish personal data";
"RMBT-INFO-CLINETUUID" = "Client UUID";
"RMBT-INFO-TESTCOUNT"  = "Test count";
"RMBT-INFO-VERSION" = "Version";
"RMBT-INFO-SERVERVERSION" = "Server version";
"RMBT-INFO-DEVELOPEDBY" = "Developed By";
"RMBT-INFO-SOURCECODE" = "Source code";
"RMBT-INFO-LEGALNOTICE" = "Google Maps Legal Notice";

"RMBT-ABOUT-TITLE" = "%@ was created during the MoQoS project. The project partners were:";
"RMBT-ABOUT-FOOTER-TEXT" = "Visit moqos.eu for more information\nabout the project.";

/* Info Home */
"RMBT-HOME-PING" = "Ping(ms)";
"RMBT-HOME-DOWNLOADMBPS" = "Download Mbps";
"RMBT-HOME-UPLOADMBPS" = "Upload Mbps";
"RMBT-HOME-START" = "START";
"RMBT-HOME-RUNAGAIN" = "RUN AGAIN";
"RMBT-HOME-MBPS" = "(MBps)"; /* Unused */

/* Settings Items */
"RMBT-SETTINGS-ABOUT" = "About %@";
"RMBT-SETTINGS-LANGUAGE" = "Language";
"RMBT-SETTINGS-DARKMODE" = "Dark Mode";
"RMBT-SETTINGS-NERDMODESETTINGS" = "Nerd mode settings";
"RMBT-SETTINGS-DEVELOPERSETTINGS" = "Developer settings";
"RMBT-SETTINGS-ANONYMOUSMODEDESCRIPTION" = "Anonymous mode prevents association with client uuid, measurement result will be immediately disassociated.";
"RMBT-SETTINGS-NERDMODEDESCRIPTION" = "Nerd mode enables advanced features. The app will display more information before and during the test.";
"RMBT-SETTINGS-DEVELOPERSSETTINGSDESCRIPTION" = "Developer settings allow...";
"RMBT-SETTINGS-IPV4ONLY" = "IPv4 only";
"RMBT-SETTINGS-IPV6ONLY" = "IPv6 only";
"RMBT-SETTINGS-ENABLEQOSMEASUMENTS" = "QoS measurements";
"RMBT-SETTINGS-QOSMANUALLY" = "Manually";
"RMBT-SETTINGS-QOSNETWORK" = "On new network";
"RMBT-SETTINGS-QOSALWAYS" = "Always";
"RMBT-SETTINGS-ENABLEPUBLISHPERSONALDATA" = "Submit Personal Data";
"RMBT-SETTINGS-ENABLESUBMITZEROTESTING" = "Submit Zero Testing";
"RMBT-SETTINGS-GENERAL" = "General";
"RMBT-SETTINGS-INFORMATION" = "Information";
"RMBT-SETTINGS-QUALITYOFSERVICE" = "Quality of services";
"RMBT-SETTINGS-QUALITYOFSERVICEDESCRIPTION" = "Quality of Service measurements include ...";
"RMBT-SETTINGS-QOSENABLED" = "QOS enabled";
"RMBT-SETTINGS-QOSDISABLED" = "QOS disabled";
"RMBT-SETTINGS-NERDMODE" = "Nerd mode";
"RMBT-SETTINGS-ENABLENERDMODE" = "Enable nerd mode";
"RMBT-SETTINGS-ANONYMOUSMODE" = "Anonymous mode";
"RMBT-SETTINGS-DEVELOPERSETTINGS" = "Developer settings";
"RMBT-SETTINGS-ADVANCEDSETTINGS" = "Advanced settings";

"RMBT-DEVSETTINGS-DISTANCE" = "Distance (meters)";
"RMBT-DEVSETTINGS-MINDELAY" = "Interval (mins)";
"RMBT-DEVSETTINGS-MAXTESTS" = "Test count";
"RMBT-DEVSETTINGS-LOOPMODE" = "Loop mode";
"RMBT-DEVSETTINGS-SKIPQOSTESTS" = "Skip QOS tests";

"RMBT-SETTINGS-SEND-LOG" = "Send Log";
"RMBT-SETTINGS-CONTROL-SERVER" = "Control Server";
"RMBT-SETTINGS-IS-OVERRIDE-CONTROL-SERVER" = "Is override Control Server";
"RMBT-SETTINGS-DEV" = "Dev Section";
"dev.code" = "Dev Code";

"RMBT-SETTINGS-LANGUAGE-SYSTEM-DEFAULT" = "System default";
"RMBT-SETTINGS-PRIVACY" = "Privacy";
"RMBT-SETTINGS-LOCATION" = "Location";
"RMBT-SETTINGS-LOCATION-DESCRIPTION" = "Manage the permissions regarding the Location tracking";
"RMBT-SETTINGS-ADS-PERSONALISATION" = "Opt out of Ads Personalisation";
"RMBT-SETTINGS-ADS-PERSONALISATION-DESCRIPTION" = "Manage the permissions regarding the Advertising ID";
"RMBT-SETTINGS-PERSISTENT-UUID" = "Persistent Client UUID";
"RMBT-SETTINGS-PERSISTENT-UUID-DESCRIPTION" = "Persistent Client UUID is needed to enable measurement history and synchronisation of the results between devices";
"RMBT-SETTINGS-CRASH-ANALYTICS" = "Analytics";
"RMBT-SETTINGS-CRASH-ANALYTICS-DESCRIPTION" = "Enable analytics and send crash traces to us";

"RMBT-SETTINGS-ADS-PERSONALISATION-POPUP-TITLE" = "Opt out of Ads Personalisation";
"RMBT-SETTINGS-ADS-PERSONALISATION-POPUP-TEXT" = "To manage the permissions regarding the Advertising ID, please go to Settings -> Privacy -> Advertising";

"RMBT-MAIN-VIEWREPORT" = "Detailed measurement report";

"RMBT-SETTINGS-PURCHASE-COMPLETED" = "The ads have been removed. Thank you for supporting Open Nettest!";
"RMBT-SETTINGS-PURCHASE-FAILED" = "We could not complete the transaction.";

"settings.start_next_test_immediatelly" = "Start the next test immediatelly";

/* Map View Options */
"RMBT-MAP-STANDARD" = "Standard";
"RMBT-MAP-SATELLITE" = "Satellite";
"RMBT-MAP-HYBRID" = "Hybrid";
"RMBT-MAP-BASIC" = "Basic";
"RMBT-MAP-STREETS" = "Streets";

"RMBT-MAP-OVERLAYOPTIONS" = "Map Options Overlay View"; /* Unused */
"RBMT-MAP-CURRENTSETTINGS" = "Current Settings"; /* Unused */

"RMBT-DEVSETTINGS-SEVERCONTROLVERSION" = "Control server version";
"RMBT-DEVSETTINGS-SEVER" = "Server";
"RMBT-DEVSETTINGS-ENABLED" = "Enabled";
"RMBT-DEVSETTINGS-NOGPS" = "No GPS";

"RBMT-BASE-DECLINE" = "Decline";
"RBMT-BASE-AGREE" = "Agree";
"RBMT-BASE-CONTINUE" = "Continue";

"RBMT-CONSUMPTION" = "The test may cause increased data consumption";
"RBMT-BASE-PACKETLOSS" = "Packet loss";
"RBMT-BASE-JITTER" = "Jitter";
"RBMT-BASE-TRAFFIC" = "Current traffic";
"RBMT-DISABLED" = "Disabled";
"RBMT-BASE-TESTSERVER" = "Test server";
"RBMT-BASE-MEASUREMENTSERVERS" = "Measurement servers";
"RBMT-HISTORY-NORECORDSYET" = "No tests have been performed from this device yet";
"history.error.server_not_available" = "The server is not available. Try again later.";
"history.empty.button.title" = "Run your first test";

/* Rate texts */
/* "RMBT-RATE-MESSAGE" = "If you like MyApp, please take the time and write review"; */
/* "RMBT-RATE-TITLE" = ""; */
/* "RMBT-RATE-RATE_LABEL" = "Yes"; */
/* "RMBT-RATE-CANCEL_LABEL" = "No, Thanks"; */
/* "RMBT-RATE-REMIND_LABEL" = "Remind Me Later"; */

/* Test qos titles */
"test.network" = "NETWORK";
"test.title.qos" = "QoS";
"test.title.performed" = "PERFORMED";
"test.title.passed" = "PASSED";
"test.title.failed" = "FAILED";
"test.title.test" = "Running QoS tests: ";
"test.init.title" = "Test";

/* Tests descriptions */
"test.qos.titles.web-page" = "Web page";
"test.qos.titles.TCP-ports" = "TCP ports";
"test.qos.titles.UDP-ports" = "UDP ports";
"test.qos.titles.voice-over-IP" = "Voice over IP";
"test.qos.titles.traceroute" = "Traceroute";
"test.qos.titles.unmodified-content" = "Unmodified content";
"test.qos.titles.transparent-connection" = "Transparent connection";
"test.qos.titles.DNS" = "DNS";

"test.qos.descriptions.web-page" = "This test checks if a reference web page, based on the ETSI Kepler reference page, can be transfered over the internet.";
"test.qos.descriptions.TCP-ports" = "TCP ports are used to transfer email, web pages and other iternet content.";
"test.qos.descriptions.UDP-ports" = "UDP ports are used for IP-based telephony, voice and video streaming.";
"test.qos.descriptions.voice-over-IP" = "A two-way telephone call over the internet is simulated.";
"test.qos.descriptions.traceroute" = "This test records the network route between this device and the server.";
"test.qos.descriptions.unmodified-content" = "This test checks if the data from the server is not being modified during the transfer.";
"test.qos.descriptions.transparent-connection" = "This test checks if a request for web page is not being modified by a proxy.";
"test.qos.descriptions.DNS" = "DNS is the directory of the internet addresses. This test checks if the DNS responses are not manipulated.";

/* Show Detailed Results button */
"test.show-detailed-results" = "Detailed Results";


"measurement.unknown_error.message" = "Measurement was aborted due to an unknown error.";
"measurement.unknown_error.title" = "Measurement error";

/* History headers */
"history.header.ping" = "Ping";
"history.header.test" = "TEST / DATE";
"history.header.packet-loss" = "PACKET LOSS";
"history.header.jitter" = "JITTER";
"history.header.download" = "Download";
"history.header.upload" = "Upload";
"history.header.qos" = "QoS";

/* Class = "UILabel"; text = "I agree with NKOM's PrivacyPolicy and Terms of Use for Nettfart.";  */
"RBMT-BASE-AGREEMENT" = "I agree with the Privacy Policy and Terms of Use.";
"RBMT-BASE-AGREEMENT-TERMS-AND-CONDITIONS" = "I agree with the Terms of Use.";
"RBMT-BASE-AGREEMENT-PRIVACY-POLICY" = "I agree with the Privacy Policy.";
"RBMT-PERSONAL-DATA-AGREEMENT" = "I agree to submit personal data.";

"info.text.open_data_sources_notice" = "In addition to our own data, we use and process open data from the following sources under Creative Commons Attribution 4.0 International license (CC BY 4.0): RTR-Netztest by RTR-GmbH, Austria; AKOS Test Net by AKOS, Slovenia; Netmetr by CZ.NIC, Czechia; Merac Internetu by RU, Slovakia."; /* Make customization */


"info.title.open_data_sources_notice" = "Open data sources";

"wizard.button.i_agree_to_all" = "I Agree To All";
"wizard.button.essential_settings_only" = "Essential Settings Only";
"wizard.button.details" = "Settings";

"wizard.one_page.title" = "Welcome to %@";
"wizard.one_page.privacy_description" = "Before you start using the app, we would like you to review the %@ and make informed choices about the personal data. You can also revisit it later via the Menu / Info Page. You can always contact us with your privacy concerns at %@.";
"wizard.one_page.analytics_title" = "ANALYTICS";
"wizard.one_page.analytics_description" = "Analytics information is used to understand how our users use the mobile apps and to continuously optimize the service. We also collect crash traces data that help us to statistically evaluate, analyze and resolve crashes and bugs. We also use Advertising identifier to attribute previously served advertising to an app installation and for user analytics.";
"wizard.one_page.persistent_client_title" = "PERSISTENT CLIENT UUID";
"wizard.one_page.persistent_client_description" = "Client UUID is a randomly generated ID that is saved with every measurement. Persistent Client UUID means that the ID is the same for your every measurement. It is needed to enable measurement history and synchronization of the results between devices.";
"wizard.one_page.finish_description" = "Please make your choice here. You can change it later in Settings.";


